app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Seventh title"], ["content", "Seventh Title Content here"], ["created_at", "2024-06-23 14:42:04.907104"], ["updated_at", "2024-06-23 14:42:04.907104"]]
---
    def create
      @post = Post.new(post_params)

      if @post.save

UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Sixed title"], ["updated_at", "2024-06-23 14:36:39.448222"], ["id", 6]]
---
    def update
      if @post.update(post_params)